app/controllers/users_controller.rb

UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "K R"], ["password_digest", "$2a$10$Z5Zyj6BqHFMRfs5PkYNHoO9xKT7aBGQHojkYeNSOPuhB.BxyU6KCS"], ["updated_at", "2019-06-04 11:59:20.051925"], ["id", 1]]
---
  def update
    if @user.update(user_params)